Revit 2024 API
IPointCloudAccess.Free Method
 Completes the lifetime of the object providing this interface.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
void Free()
Visual Basic
Sub Free
Visual C++
void Free()
Remarks
 Calling this function indicates that the IPointCloudAccess interface is not going to be used after the call returns, and the provider of the interface can dispose of all allocated resources.
See Also
IPointCloudAccess Interface
Autodesk.Revit.DB.PointClouds Namespace